Glorianealone593/esp32-hdwallet/sdkconfig.defaults.esp32s3
# ESP32-S3 overrides (recommended target)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
# Enable SPIRAM if present (Octal/Quad varies by module).
# CONFIG_SPIRAM=y
